#================== Задача 1 ==========================

# Сформировать список из N членов последовательности. 
# Для N = 5: 1, -3, 9, -27, 81 и т.д.

#num = int(input('Введите число: '))
#result = 1
#for i in range(0,num):
#    print(result)
#    result = result*-3

#=================== Задача 2 =========================

#Для натурального n создать словарь индекс-значение, 
#состоящий из элементов последовательности 3n + 1. 
#Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

#num = int(input('Введите число: '))
#for i in range(1,num+1):
#    result = 3*i+1
#    print(f'{i}: {result},', end =" ")

#=================== Задача 3 =========================

#Пользователь задаёт две строки. Определить количество вхождений одной строки в другой.

# str_a = str(input('Введите строку: '))
# str_b = str(input('Введите вторую строку: '))
# if str_a >= str_b:
#     count = str_a.count(str_b)
#     print(f'Сочетание {str_b} встречается {count} раз.')
# else:
#     count = str_b.count(str_a)
#     print(f'Сочетание {str_a} встречается {count} раз.')

#=================== Задача 4 =========================

# Подсчитать сумму цифр в вещественном числе.

# num = (input('Введите число: '))
# sum = 0
# for i in num:
#     if i != "." and i != "," and i != "-":
#         sum = sum + int(i)
# print(sum)

#=================== Задача 5 =========================

#Написать программу получающую набор произведений чисел от 1 до N. 
#Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ]

# num = int(input('Введите число: '))
# sum = 1
# for i in range(1,num+1):
#     sum = sum*i
#     print(sum, end = ' ')